# How to render Pandas DataFrame as HTML Table?

Syntax: DataFrame.to_html()

Return : Return the html format of a dataframe.

In [1]:
# importing pandas as pd
import pandas as pd
from IPython.display import HTML

In [2]:
# creating the dataframe
df = pd.DataFrame({"Name": ['Anurag', 'Manjeet', 'Shubham', 
                            'Saurabh', 'Ujjawal'],
                    
                   "Address": ['Patna', 'Delhi', 'Coimbatore',
                               'Greater noida', 'Patna'],
                    
                   "ID": [20123, 20124, 20145, 20146, 20147],
                    
                   "Sell": [140000, 300000, 600000, 200000, 600000]})

In [3]:
df

      Name        Address     ID    Sell
0   Anurag          Patna  20123  140000
1  Manjeet          Delhi  20124  300000
2  Shubham     Coimbatore  20145  600000
3  Saurabh  Greater noida  20146  200000
4  Ujjawal          Patna  20147  600000

In [4]:
print("Original DataFrame :")
display(df)

Original DataFrame :

      Name        Address     ID    Sell
0   Anurag          Patna  20123  140000
1  Manjeet          Delhi  20124  300000
2  Shubham     Coimbatore  20145  600000
3  Saurabh  Greater noida  20146  200000
4  Ujjawal          Patna  20147  600000

# Step 2: Convert Dataframe to Html Table

In [5]:
result = df.to_html()
print(result)

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>Name</th>
      <th>Address</th>
      <th>ID</th>
      <th>Sell</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>Anurag</td>
      <td>Patna</td>
      <td>20123</td>
      <td>140000</td>
    </tr>
    <tr>
      <th>1</th>
      <td>Manjeet</td>
      <td>Delhi</td>
      <td>20124</td>
      <td>300000</td>
    </tr>
    <tr>
      <th>2</th>
      <td>Shubham</td>
      <td>Coimbatore</td>
      <td>20145</td>
      <td>600000</td>
    </tr>
    <tr>
      <th>3</th>
      <td>Saurabh</td>
      <td>Greater noida</td>
      <td>20146</td>
      <td>200000</td>
    </tr>
    <tr>
      <th>4</th>
      <td>Ujjawal</td>
      <td>Patna</td>
      <td>20147</td>
      <td>600000</td>
    </tr>
  </tbody>
</table>

# Step 3: Write the Script For Convert DataFrame into HTML File

In [6]:
html = df.to_html()
 
# write html to file
text_file = open("index.html", "w")
text_file.write(html)
text_file.close()

In [7]:
HTML(df.to_html(classes='table table-stripped'))